content-org/posts.org
#+hugo_base_dir: ../

** DONE A Website                                            :@tech:thoughts:
:PROPERTIES:
:EXPORT_FILE_NAME: post1
:EXPORT_DATE: 2025-09-05
:END:

I decided a few weeks back, while interning at Tudor, to create a new website.

The initial reason was that circumstances conspired to make me use a command line editor in order to debug something.
In the second semester of my freshman year, I was forced to use Emacs for a week.
No reason was given.
I did not enjoy this task from above because Emacs felt cumbersome and the commands they gave us were stuff like "move your cursor to the next instance of a character" and "select and copy text".
It makes sense to teach basic commands to someone starting out on an editor, but I was never given a reason why I /should/ use Emacs at all.
Emacs is Emacs because of its huge and, most importantly, extensible[^fn:1] library of modes and commands.
Anyways, I still barely know any Emacs and haven't used it for any big projects yet but I have been using Orgmode semi-regularly and have found it quite useful.

I thought that Orgmode would be a good way to start out with Emacs, and ox-hugo a good way to start out with Orgmode.
I also think that personal websites are cool and that everyone should have one because it's probably the most coherent way in which you can present yourself to the world.

So, we'll see how this goes!

[^fn:1]:  I have yet to grasp elisp, or lisp in general, so the only script I've written is one that replaces a key sequence with an em-dash.

